//Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
int[] A = {1, 2, 5, 7, 19, 6, 1, 33};
for (int i = 0; i < A[i]; i++);
Console.WriteLine("[" + string.Join(", ", A) + "]");
